{
  "data": {
    "id": 3052,
    "name": "GoCrypto Token",
    "symbol": "GOC",
    "slug": "gocrypto-token",
    "category": "token",
    "description": "## What is GoCrypto Token?\n\nGoCrypto Token (GOC) stands out as a versatile payment solution, integrating seamlessly into various facets of commerce. It offers customizable solutions for smart POS devices, online shopping, and event ticketing. Businesses can settle transactions in either cryptocurrency or local currency, and benefit from a free analytical tool for business and accounting purposes.\n\nGOC is a multichain utility token, issued on multiple blockchains including Bitcoin Cash (SLP), Smart Bitcoin Cash (smartBCH), BNB Smart Chain (BSC), and Polygon (MATIC). This multichain approach enhances its flexibility and usability across different platforms. The GoCrypto platform leverages GOC for payments, making it a central component of its ecosystem.\n\nUsers of the Elly Wallet can utilize GOC for shopping at both physical and online stores. In selected countries, they can also receive tokenback rewards for every purchase, incentivizing the use of GOC in everyday transactions. The tokenback program adds an extra layer of value, encouraging consumer engagement and loyalty.\n\nThe GoCrypto platform's holistic approach ensures that businesses and consumers alike can benefit from the seamless integration of cryptocurrency into their daily operations, making GOC a pivotal element in the evolving landscape of digital payments.\n\n### What is the technology behind GoCrypto Token?\n\nThe technology behind GoCrypto Token (GOC) is a fascinating blend of blockchain innovation and practical payment solutions. At its core, GoCrypto Token operates on multiple blockchains, including Bitcoin Cash (SLP), Smart Bitcoin Cash (smartBCH), BNB Smart Chain (BSC), and Polygon (MATIC). This multi-chain approach enhances the token's versatility and accessibility, allowing it to integrate seamlessly into various ecosystems.\n\nOne of the standout features of GoCrypto Token is its role in the GoCrypto platform, a global crypto and card payment infrastructure. This platform enables users to make payments using cryptocurrencies at both physical and online stores. The integration with the Elly Wallet further enhances its utility, allowing users to receive tokenback rewards for their purchases. This incentivizes the use of GOC, creating a more engaging and rewarding experience for consumers.\n\nThe blockchain technology underlying GOC is designed to be secure and resilient against attacks. Blockchains like Bitcoin Cash and BNB Smart Chain utilize a consensus mechanism known as Proof of Work (PoW), which involves miners solving complex mathematical problems to validate transactions and secure the network. This process makes it extremely difficult for bad actors to alter transaction data, as they would need to control a majority of the network's computational power, which is practically unfeasible.\n\nIn addition to PoW, some of the blockchains supporting GOC, such as Polygon, use a Proof of Stake (PoS) consensus mechanism. In PoS, validators are chosen based on the number of tokens they hold and are willing to \"stake\" as collateral. This method is energy-efficient and provides robust security by making it economically disadvantageous for validators to act maliciously.\n\nThe multi-chain nature of GoCrypto Token also means that it benefits from the unique features and strengths of each blockchain. For instance, the Bitcoin Cash blockchain is known for its low transaction fees and fast processing times, making it ideal for everyday transactions. On the other hand, BNB Smart Chain offers compatibility with Ethereum-based applications, expanding the potential use cases for GOC.\n\nMoreover, the GoCrypto platform's tokenback program is a significant technological innovation. By rewarding users with GOC for their purchases, the platform not only promotes the use of the token but also fosters a loyal user base. This program is seamlessly integrated with the Elly Wallet, which supports various cryptocurrencies and allows users to manage their digital assets efficiently.\n\nThe security of the GoCrypto ecosystem is further bolstered by smart contracts, which are self-executing contracts with the terms of the agreement directly written into code. These smart contracts automate transactions and ensure that they are executed only when predefined conditions are met, reducing the risk of fraud and errors.\n\nThe GoCrypto Token's ability to operate across multiple blockchains also enhances its interoperability. This means that users can easily transfer GOC between different blockchain networks, providing greater flexibility and convenience. For example, a user can move their GOC from the Bitcoin Cash blockchain to the Polygon network to take advantage of lower fees or faster transaction times.\n\nAdditionally, the GoCrypto platform supports a wide range of payment methods, including traditional credit and debit cards, alongside cryptocurrencies. This hybrid approach ensures that merchants and consumers can choose the payment method that best suits their needs, making the platform more inclusive and user-friendly.\n\nThe Elly Wallet, an integral part of the GoCrypto ecosystem, offers a user-friendly interface and robust security features. It supports multiple cryptocurrencies, allowing users to manage their digital assets in one place. The wallet's integration with the GoCrypto platform means that users can easily spend their GOC at participating merchants and receive tokenback rewards, enhancing the overall user experience.\n\nThe GoCrypto Token's multi-chain architecture, combined with its integration into a global payment infrastructure, smart contract capabilities, and tokenback rewards program, makes it a versatile and secure digital asset. This comprehensive approach ensures that GOC can meet the diverse needs of users and merchants, providing a seamless and rewarding payment experience.\n\n### What are the real-world applications of GoCrypto Token?\n\nGoCrypto Token (GOC) is a versatile cryptocurrency designed to enhance the global payment landscape. It operates on multiple blockchains, including Bitcoin Cash (SLP), Smart Bitcoin Cash (smartBCH), BNB Smart Chain (BSC), and Polygon (MATIC). This multichain approach ensures flexibility and broad usability.\n\nOne of the primary applications of GOC is facilitating global crypto and card payments. This means that businesses worldwide can accept GOC as a form of payment, making transactions smoother and more inclusive. Retail businesses, both physical and online, can accept over 50 different cryptocurrencies through the GoCrypto platform, simplifying the payment process for customers and merchants alike.\n\nAnother significant application is the tokenback program available through the Elly Wallet. Users can shop at various stores and receive rewards in the form of GOC tokens. This incentivizes the use of cryptocurrency for everyday purchases, promoting wider adoption.\n\nGOC also plays a crucial role in building crypto payment infrastructure. By providing customizable solutions for payment service providers, it helps integrate cryptocurrency payments into existing financial systems. This integration is vital for making crypto-to-fiat transactions more accessible and efficient.\n\nMoreover, GOC supports open borders for countries and cities aiming to attract crypto travelers and projects. This aspect is particularly beneficial for regions looking to boost their economy by embracing digital currencies and the innovations they bring.\n\nThe decentralized nature of GOC ensures that payments are secure and transparent, reducing the reliance on traditional banking systems. This decentralization can lead to lower transaction fees and faster processing times, benefiting both consumers and businesses.\n\nIn essence, GoCrypto Token (GOC) is a multifaceted cryptocurrency with real-world applications that span global payments, retail incentives, infrastructure development, and economic growth through crypto adoption.\n\n### What key events have there been for GoCrypto Token?\n\nThe GoCrypto Token (GOC) has carved a niche in the cryptocurrency landscape with its multifaceted utility and strategic integrations. Initially launched on multiple blockchains, including Bitcoin Cash (SLP), Smart Bitcoin Cash (smartBCH), BNB Smart Chain (BSC), and Polygon (MATIC), GOC has been pivotal in enhancing the GoCrypto platform's payment solutions.\n\nOne of the significant milestones for GoCrypto Token was its integration into the Elly Wallet. This integration allowed users to utilize GOC for shopping at both physical and online stores. Additionally, in selected countries, users could benefit from the tokenback program, receiving rewards for their purchases, thus incentivizing the use of GOC in everyday transactions.\n\nIn 2022, GoCrypto made headlines with its involvement in Primavera Sound, a renowned music festival. The introduction of crypto payments at this event marked a significant step in mainstream adoption, showcasing the practical utility of GOC in large-scale events. This move not only highlighted the versatility of GOC but also demonstrated its potential to streamline payment processes in diverse settings.\n\nAnother noteworthy event was the introduction of crypto payments at Tuš, a prominent Slovenian national grocery retail chain. This integration underscored GoCrypto's commitment to expanding its payment infrastructure and making cryptocurrency transactions more accessible to the general public. By enabling crypto payments at a major retail chain, GoCrypto facilitated a seamless shopping experience for users, further solidifying GOC's role in everyday commerce.\n\nGoCrypto's extensive payment infrastructure in Europe is another highlight. With over 1300 locations accepting more than 50 cryptocurrencies, GoCrypto boasts one of the widest crypto payment networks in the region. This extensive network not only enhances the utility of GOC but also positions it as a key player in the European cryptocurrency payment landscape.\n\nThe GoCrypto platform offers a range of payment solutions tailored for various sectors, including events, retail, payment service providers, and back-office operations. These solutions are designed to streamline payment processes, making it easier for businesses to adopt and integrate cryptocurrency payments. The versatility of GOC in these applications underscores its value proposition and potential for widespread adoption.\n\nThe launch of GOC on multiple blockchains has also been a critical development. By being available on Bitcoin Cash (SLP), Smart Bitcoin Cash (smartBCH), BNB Smart Chain (BSC), and Polygon (MATIC), GOC ensures greater accessibility and flexibility for users. This multichain approach enhances the token's interoperability, allowing it to be used across different blockchain ecosystems seamlessly.\n\nIn the context of cryptocurrency, GOC's market performance has been noteworthy. While specific details about its current market standing are beyond the scope of this overview, the token's integration into various platforms and its adoption in real-world applications highlight its growing relevance and utility in the crypto space.\n\n### Who are the founders of GoCrypto Token?\n\nGoCrypto Token (GOC) is a multichain utility token issued on the Bitcoin Cash (SLP) blockchain, Smart Bitcoin Cash (smartBCH), BNB Smart Chain (BSC), and Polygon (MATIC). The founders of GoCrypto Token is Dejan Roljić. Dejan Roljić, an entrepreneur with a background in fintech and blockchain, played a crucial role in the development and launch of GoCrypto Token.\n\n",
    "dateAdded": "2018-08-03T00:00:00.000Z",
    "status": "active",
    "subStatus": "normal",
    "notice": "",
    "alertType": 2,
    "alertLink": "",
    "latestUpdateTime": "2024-11-18T01:09:00.000Z",
    "watchCount": "12085",
    "watchListRanking": 2035,
    "latestAdded": false,
    "launchPrice": 0.1,
    "tags": [
      {
        "slug": "ai-big-data",
        "name": "AI & Big Data",
        "category": "INDUSTRY"
      }
    ],
    "selfReportedTags": [
      "E-commerce",
      "Web3",
      "Token"
    ],
    "urls": {
      "website": [
        "https://gocrypto.com/"
      ],
      "technical_doc": [],
      "explorer": [
        "https://simpleledger.info/#token/3f83fa9f168f01d68933ef5fdb77143b2376ba7bf3a78175258861982d90d500",
        "https://bscscan.com/token/0x4b85a666dec7c959e88b97814e46113601b07e57",
        "https://polygonscan.com/token/0x4b85a666dec7c959e88b97814e46113601b07e57",
        "https://sonar.cash/token/0x4B85a666deC7C959e88b97814E46113601B07e57/token-transfers"
      ],
      "source_code": [],
      "message_board": [
        "https://gocrypto.com/blog"
      ],
      "chat": [
        "https://t.me/GoCrypto_official"
      ],
      "announcement": [
        "https://t.me/GoCrypto_official"
      ],
      "reddit": [],
      "facebook": [],
      "twitter": []
    },
    "volume": 104254.41781275,
    "volumeChangePercentage24h": 16.1349,
    "cexVolume": 103887.7363828,
    "dexVolume": 366.68142995,
    "statistics": {
      "price": 0.0031505573190865267,
      "priceChangePercentage1h": 0.00810354,
      "priceChangePercentage24h": 1.86898677,
      "priceChangePercentage7d": 3.50186631,
      "priceChangePercentage30d": -5.07772115,
      "priceChangePercentage60d": -10.01334804,
      "priceChangePercentage90d": -7.66594553,
      "priceChangePercentage1y": 16.54963242,
      "priceChangePercentageAll": -83.277917916603,
      "marketCap": 772763.78,
      "marketCapChangePercentage24h": 1.869,
      "fullyDilutedMarketCap": 942318.33,
      "fullyDilutedMarketCapChangePercentage24h": 1.87,
      "circulatingSupply": 245278437.79,
      "totalSupply": 299095759.0,
      "marketCapDominance": 0.0,
      "rank": 1951,
      "roi": -96.84944268,
      "low24h": 0.003090161136270098,
      "high24h": 0.003161933594682897,
      "low7d": 0.00304236940025042,
      "high7d": 0.003224596451542737,
      "low30d": 0.003033309740292305,
      "high30d": 0.003578996832534998,
      "low90d": 0.003033309740292305,
      "high90d": 0.003910056686871139,
      "low52w": 0.002482738931417573,
      "high52w": 0.011339351422199181,
      "lowAllTime": 0.002243627144505615,
      "highAllTime": 0.24667854951883136,
      "lowAllTimeChangePercentage": 40.42,
      "highAllTimeChangePercentage": -98.72,
      "lowAllTimeTimestamp": "2023-11-14T18:54:00.000Z",
      "highAllTimeTimestamp": "2021-11-11T12:16:11.000Z",
      "lowYesterday": 0.003090161136270098,
      "highYesterday": 0.003161933594682897,
      "openYesterday": 0.003091742143671553,
      "closeYesterday": 0.003150434839836891,
      "priceChangePercentageYesterday": 1.9,
      "volumeYesterday": 104524.62,
      "turnover": 0.13491111,
      "ytdPriceChangePercentage": -58.1479,
      "volumeRank": 2687,
      "volumeMcRank": 1561,
      "mcTotalNum": 10049,
      "volumeTotalNum": 10049,
      "volumeMcTotalNum": 10049
    },
    "quotes": [],
    "platforms": [
      {
        "contractId": 1839,
        "contractAddress": "0x4b85a666dec7c959e88b97814e46113601b07e57",
        "contractPlatform": "BNB Smart Chain (BEP20)",
        "contractPlatformId": 14,
        "contractChainId": 56,
        "contractRpcUrl": [
          "https://bsc-dataseed1.binance.org",
          "https://bsc-dataseed.binance.org/",
          "https://bsc-dataseed1.binance.org:443"
        ],
        "contractNativeCurrencyName": "Binance Chain Native Token",
        "contractNativeCurrencySymbol": "BNB",
        "contractNativeCurrencyDecimals": 18,
        "contractBlockExplorerUrl": "https://bscscan.com/",
        "contractExplorerUrl": "https://bscscan.com/token/0x4b85a666dec7c959e88b97814e46113601b07e57",
        "contractDecimals": 18,
        "platformCryptoId": 1839,
        "sort": 0,
        "wallets": [
          {
            "id": 9025
          }
        ]
      },
      {
        "contractId": 3890,
        "contractAddress": "0x4b85a666dec7c959e88b97814e46113601b07e57",
        "contractPlatform": "Polygon",
        "contractPlatformId": 25,
        "contractChainId": 137,
        "contractRpcUrl": [
          "https://rpc-mainnet.maticvigil.com"
        ],
        "contractNativeCurrencyName": "MATIC",
        "contractNativeCurrencySymbol": "MATIC",
        "contractNativeCurrencyDecimals": 18,
        "contractBlockExplorerUrl": "https://polygonscan.com",
        "contractExplorerUrl": "https://polygonscan.com/token/0x4b85a666dec7c959e88b97814e46113601b07e57",
        "contractDecimals": 18,
        "platformCryptoId": 3890,
        "sort": 0,
        "wallets": [
          {
            "id": 9025
          }
        ]
      },
      {
        "contractId": 1831,
        "contractAddress": "3f83fa9f168f01d68933ef5fdb77143b2376ba7bf3a78175258861982d90d500",
        "contractPlatform": "Bitcoin Cash",
        "contractPlatformId": 39,
        "contractChainId": -1,
        "contractRpcUrl": [],
        "contractNativeCurrencyName": "",
        "contractNativeCurrencySymbol": "",
        "contractNativeCurrencyDecimals": -1,
        "contractBlockExplorerUrl": "",
        "contractExplorerUrl": "https://www.smartscan.cash/address/3f83fa9f168f01d68933ef5fdb77143b2376ba7bf3a78175258861982d90d500",
        "contractDecimals": 18,
        "platformCryptoId": 1831,
        "sort": 0,
        "wallets": []
      }
    ],
    "relatedCoins": [
      {
        "id": 2513,
        "name": "GoldMint",
        "slug": "goldmint",
        "price": 0.05065701161697734,
        "priceChangePercentage24h": -0.83488657,
        "priceChangePercentage7d": 21.70106268
      },
      {
        "id": 4679,
        "name": "Band Protocol",
        "slug": "band-protocol",
        "price": 1.2924689407590508,
        "priceChangePercentage24h": -5.51284503,
        "priceChangePercentage7d": 1.82102584
      },
      {
        "id": 7083,
        "name": "Uniswap",
        "slug": "uniswap",
        "price": 8.907804423933275,
        "priceChangePercentage24h": -4.39447372,
        "priceChangePercentage7d": -3.90346035
      },
      {
        "id": 1414,
        "name": "Firo",
        "slug": "firo",
        "price": 1.3454938776288508,
        "priceChangePercentage24h": 0.21867821,
        "priceChangePercentage7d": 4.03360084
      },
      {
        "id": 1975,
        "name": "Chainlink",
        "slug": "chainlink",
        "price": 14.028344717813509,
        "priceChangePercentage24h": -5.25786687,
        "priceChangePercentage7d": -2.46572024
      },
      {
        "id": 7653,
        "name": "Oasis",
        "slug": "oasis-network",
        "price": 0.08025331330873264,
        "priceChangePercentage24h": -5.30717197,
        "priceChangePercentage7d": -4.39563858
      },
      {
        "id": 707,
        "name": "Blocknet",
        "slug": "blocknet",
        "price": 0.017113298239738093,
        "priceChangePercentage24h": -0.68391562,
        "priceChangePercentage7d": -3.30053472
      },
      {
        "id": 5864,
        "name": "yearn.finance",
        "slug": "yearn-finance",
        "price": 6192.38803639104,
        "priceChangePercentage24h": -4.43119421,
        "priceChangePercentage7d": -11.362147
      },
      {
        "id": 4279,
        "name": "Solar",
        "slug": "sxp",
        "price": 0.36376553390538346,
        "priceChangePercentage24h": 2.1116243,
        "priceChangePercentage7d": 18.12789401
      },
      {
        "id": 8043,
        "name": "MAHA.xyz",
        "slug": "mahadao",
        "price": 0.9034865737660874,
        "priceChangePercentage24h": -2.68820884,
        "priceChangePercentage7d": -9.89747239
      }
    ],
    "wallets": [
      {
        "id": 9025,
        "name": "MetaMask",
        "tier": 1,
        "url": "https://metamask.io/",
        "chains": "ETH,ETZ",
        "types": "pc",
        "introduction": "",
        "star": 1.0,
        "security": 2.0,
        "easyToUse": 4.0,
        "decentration": false,
        "focusNumber": 0,
        "rank": 1000013,
        "logo": "9025.png",
        "multipleChain": true
      },
      {
        "id": 9152,
        "name": "Binance Chain Wallet",
        "url": "https://www.binance.org/en/blog/binance-extension-wallet/",
        "chains": "BNB",
        "types": "",
        "introduction": "",
        "star": 0.0,
        "security": 0.0,
        "easyToUse": 0.0,
        "decentration": false,
        "focusNumber": 0,
        "logo": "9152.png",
        "multipleChain": false
      }
    ],
    "isAudited": true,
    "auditInfos": [
      {
        "coinId": "3052",
        "auditor": "CertiK",
        "auditStatus": 2,
        "auditTime": "2021-10-20T13:21:07.268Z",
        "reportUrl": "https://cmc.certik-skynet.com/redirect?project=gocrypto"
      }
    ],
    "holders": {},
    "displayTV": 1,
    "isInfiniteMaxSupply": 0,
    "tvCoinSymbol": "GOC",
    "supportWalletInfos": [
      {
        "id": 9025,
        "name": "MetaMask",
        "url": "https://metamask.io/",
        "chains": "ETH,ETZ",
        "decentration": false,
        "logo": "9025.png",
        "multipleChain": false
      },
      {
        "id": 9152,
        "name": "Binance Chain Wallet",
        "url": "https://www.binance.org/en/blog/binance-extension-wallet/",
        "chains": "BNB",
        "decentration": false,
        "logo": "9152.png",
        "multipleChain": false
      }
    ],
    "holdersFlag": false,
    "ratingsFlag": false,
    "analysisFlag": false,
    "socialsFlag": false,
    "cryptoRating": [
      {
        "type": "CertiK",
        "score": 76.0,
        "rating": 3.8,
        "updateTime": "2024-11-17T00:00:00.000Z",
        "link": "https://cmc.certik-skynet.com/redirect?project=gocrypto&utm_source=CMC&utm_campaign=ScoreByCertiKLink"
      },
      {
        "type": "Cyberscope",
        "score": 55.0,
        "rating": 2.8,
        "updateTime": "2024-11-17T10:54:44.000Z",
        "link": "https://www.cyberscope.io/audits/coin-gocrypto-token"
      },
      {
        "type": "Aggregate rating",
        "score": 65.5,
        "rating": 3.3,
        "updateTime": "2024-11-18T01:00:00.184Z"
      }
    ],
    "hasExtraInfoFlag": false,
    "upcoming": {
      "status": false
    },
    "annotationFlag": false,
    "similarCoins": [
      {
        "id": 2572,
        "symbol": "BAX"
      },
      {
        "id": 2305,
        "symbol": "NGC"
      },
      {
        "id": 5221,
        "symbol": "HNS"
      },
      {
        "id": 1298,
        "symbol": "LBC"
      },
      {
        "id": 5908,
        "symbol": "DKA"
      },
      {
        "id": 12458,
        "symbol": "KST"
      }
    ]
  },
  "status": {
    "timestamp": "2024-11-18T01:10:01.120Z",
    "error_code": "0",
    "error_message": "SUCCESS",
    "elapsed": "11",
    "credit_count": 0
  }
}